MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGP20000/mcu.h
/*******************************************************************************
* RTC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WTCR1;
        stc_rtc_wtcr1_field_t WTCR1_f;
        struct {
          union {
            __IO uint16_t WTCR1L;
            struct {
              __IO uint8_t WTCR1LL;
              __IO uint8_t WTCR1LH;
            };
          };
          union {
            __IO uint16_t WTCR1H;
            struct {
              __IO uint8_t WTCR1HL;
              __IO uint8_t WTCR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t WTCR2;
        stc_rtc_wtcr2_field_t WTCR2_f;
        struct {
          union {
            __IO uint16_t WTCR2L;
            struct {
              __IO uint8_t WTCR2LL;
              __IO uint8_t WTCR2LH;
            };
          };
          union {
            __IO uint16_t WTCR2H;
            struct {
              __IO uint8_t WTCR2HL;
              __IO uint8_t WTCR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t WTBR;
        stc_rtc_wtbr_field_t WTBR_f;
        struct {
          union {
            __IO uint16_t WTBRL;
            struct {
              __IO uint8_t WTBRLL;
              __IO uint8_t WTBRLH;
            };
          };
          union {
            __IO uint16_t WTBRH;
            struct {
              __IO uint8_t WTBRHL;
              __IO uint8_t WTBRHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t WTSR;
        stc_rtc_wtsr_field_t WTSR_f;
    };
    union {
        __IO  uint8_t WTMIR;
        stc_rtc_wtmir_field_t WTMIR_f;
    };
    union {
        __IO  uint8_t WTHR;
        stc_rtc_wthr_field_t WTHR_f;
    };
    union {
        __IO  uint8_t WTDR;
        stc_rtc_wtdr_field_t WTDR_f;
    };
    union {
        __IO  uint8_t WTDW;
        stc_rtc_wtdw_field_t WTDW_f;
    };
    union {
        __IO  uint8_t WTMOR;
        stc_rtc_wtmor_field_t WTMOR_f;
    };
    union {
        __IO  uint8_t WTYR;
        stc_rtc_wtyr_field_t WTYR_f;
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO  uint8_t ALMIR;
        stc_rtc_almir_field_t ALMIR_f;
    };
    union {
        __IO  uint8_t ALHR;
        stc_rtc_alhr_field_t ALHR_f;
    };
    union {
        __IO  uint8_t ALDR;
        stc_rtc_aldr_field_t ALDR_f;
    };
        __IO  uint8_t RESERVED1[1];
    union {
        __IO  uint8_t ALMOR;
        stc_rtc_almor_field_t ALMOR_f;
    };
    union {
        __IO  uint8_t ALYR;
        stc_rtc_alyr_field_t ALYR_f;
    };
        __IO  uint8_t RESERVED2[1];
    union {
        __IO uint32_t WTTR;
        stc_rtc_wttr_field_t WTTR_f;
        struct {
          union {
            __IO uint16_t WTTRL;
            struct {
              __IO uint8_t WTTRLL;
              __IO uint8_t WTTRLH;
            };
          };
          union {
            __IO uint16_t WTTRH;
            struct {
              __IO uint8_t WTTRHL;
              __IO uint8_t WTTRHH;
            };
          };
        };
    };
    union {
        __IO  uint8_t WTCLKS;
        stc_rtc_wtclks_field_t WTCLKS_f;
    };
    union {
        __IO  uint8_t WTCLKM;
        stc_rtc_wtclkm_field_t WTCLKM_f;
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t WTCAL;
        stc_rtc_wtcal_field_t WTCAL_f;
        struct {
            __IO  uint8_t WTCALL;
            __IO  uint8_t WTCALH;
        };
    };
    union {
        __IO  uint8_t WTCALEN;
        stc_rtc_wtcalen_field_t WTCALEN_f;
    };
        __IO  uint8_t RESERVED4[1];
    union {
        __IO  uint8_t WTDIV;
        stc_rtc_wtdiv_field_t WTDIV_f;
    };
    union {
        __IO  uint8_t WTDIVEN;
        stc_rtc_wtdiven_field_t WTDIVEN_f;
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO  uint8_t WTCALPRD;
        stc_rtc_wtcalprd_field_t WTCALPRD_f;
    };
        __IO  uint8_t RESERVED6[3];
    union {
        __IO  uint8_t WTCOSEL;
        stc_rtc_wtcosel_field_t WTCOSEL_f;
    };
} FM_RTC_TypeDef, FM0P_RTC_TypeDef;

/*******************************************************************************
* SBSSR_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[252];
    union {
        __IO uint16_t BTSSSR;
        stc_sbssr_btsssr_field_t BTSSSR_f;
        struct {
            __IO  uint8_t BTSSSRL;
            __IO  uint8_t BTSSSRH;
        };
    };
} FM_SBSSR_TypeDef, FM0P_SBSSR_TypeDef;

/*******************************************************************************
* SMCIF_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t GLOBALCONTROL1;
        stc_smcif_globalcontrol1_field_t GLOBALCONTROL1_f;
        struct {
            __IO  uint8_t GLOBALCONTROL1L;
            __IO  uint8_t GLOBALCONTROL1H;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t STATUS;
        stc_smcif_status_field_t STATUS_f;
        struct {
            __IO  uint8_t STATUSL;
            __IO  uint8_t STATUSH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint16_t PORTCONTROL;
        stc_smcif_portcontrol_field_t PORTCONTROL_f;
        struct {
            __IO  uint8_t PORTCONTROLL;
            __IO  uint8_t PORTCONTROLH;
        };
    };
        __IO  uint8_t RESERVED2[2];
    union {
        __IO uint16_t DATA;
        stc_smcif_data_field_t DATA_f;
        struct {
            __IO  uint8_t DATAL;
            __IO  uint8_t DATAH;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t CARDCLOCK;
        stc_smcif_cardclock_field_t CARDCLOCK_f;
        struct {
            __IO  uint8_t CARDCLOCKL;
            __IO  uint8_t CARDCLOCKH;
        };
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO uint16_t BAUDRATE;
        stc_smcif_baudrate_field_t BAUDRATE_f;
        struct {
            __IO  uint8_t BAUDRATEL;
            __IO  uint8_t BAUDRATEH;
        };
    };
        __IO  uint8_t RESERVED5[2];
    union {
        __IO uint16_t GUARDTIMER;
        stc_smcif_guardtimer_field_t GUARDTIMER_f;
        struct {
            __IO  uint8_t GUARDTIMERL;
            __IO  uint8_t GUARDTIMERH;
        };
    };
        __IO  uint8_t RESERVED6[2];
    union {
        __IO uint16_t IDLETIMER;
        stc_smcif_idletimer_field_t IDLETIMER_f;
        struct {
            __IO  uint8_t IDLETIMERL;
            __IO  uint8_t IDLETIMERH;
        };
    };
        __IO  uint8_t RESERVED7[2];
    union {
        __IO uint16_t GLOBALCONTROL2;
        stc_smcif_globalcontrol2_field_t GLOBALCONTROL2_f;
        struct {
            __IO  uint8_t GLOBALCONTROL2L;
            __IO  uint8_t GLOBALCONTROL2H;
        };
    };
        __IO  uint8_t RESERVED8[2];
    union {
        __IO uint16_t DATA_FIFO;
        stc_smcif_data_fifo_field_t DATA_FIFO_f;
        struct {
            __IO  uint8_t DATA_FIFOL;
            __IO  uint8_t DATA_FIFOH;
        };
    };
        __IO  uint8_t RESERVED9[2];
    union {
        __IO uint16_t FIFO_LEVEL_READ;
        stc_smcif_fifo_level_read_field_t FIFO_LEVEL_READ_f;
        struct {
            __IO  uint8_t FIFO_LEVEL_READL;
            __IO  uint8_t FIFO_LEVEL_READH;
        };
    };
        __IO  uint8_t RESERVED10[2];
    union {
        __IO uint16_t FIFO_LEVEL_WRITE;
        stc_smcif_fifo_level_write_field_t FIFO_LEVEL_WRITE_f;
        struct {
            __IO  uint8_t FIFO_LEVEL_WRITEL;
            __IO  uint8_t FIFO_LEVEL_WRITEH;
        };
    };
        __IO  uint8_t RESERVED11[2];
    union {
        __IO uint16_t FIFO_MODE;
        stc_smcif_fifo_mode_field_t FIFO_MODE_f;
        struct {
            __IO  uint8_t FIFO_MODEL;
            __IO  uint8_t FIFO_MODEH;
        };
    };
        __IO  uint8_t RESERVED12[2];
    union {
        __IO uint16_t FIFO_CLEAR_MSB_WRITE;
        stc_smcif_fifo_clear_msb_write_field_t FIFO_CLEAR_MSB_WRITE_f;
        struct {
            __IO  uint8_t FIFO_CLEAR_MSB_WRITEL;
            __IO  uint8_t FIFO_CLEAR_MSB_WRITEH;
        };
    };
        __IO  uint8_t RESERVED13[2];
    union {
        __IO uint16_t FIFO_CLEAR_MSB_READ;
        stc_smcif_fifo_clear_msb_read_field_t FIFO_CLEAR_MSB_READ_f;
        struct {
            __IO  uint8_t FIFO_CLEAR_MSB_READL;
            __IO  uint8_t FIFO_CLEAR_MSB_READH;
        };
    };
        __IO  uint8_t RESERVED14[6];
    union {
        __IO uint16_t IRQ_STATUS;
        stc_smcif_irq_status_field_t IRQ_STATUS_f;
        struct {
            __IO  uint8_t IRQ_STATUSL;
            __IO  uint8_t IRQ_STATUSH;
        };
    };
} FM_SMCIF_TypeDef, FM0P_SMCIF_TypeDef;

