MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGP20000/mcu.h
/*******************************************************************************
* DSTC Registers DSTC
*   Register Definition
*******************************************************************************/
#define FM_DSTC_DESTP                             *((volatile uint32_t*)(0x40061000UL))
#define FM0P_DSTC_DESTP                           *((volatile uint32_t*)(0x40061000UL))
#define FM_DSTC_HWDESP                            *((volatile uint32_t*)(0x40061004UL))
#define FM0P_DSTC_HWDESP                          *((volatile uint32_t*)(0x40061004UL))
#define FM_DSTC_CMD                               *((volatile  uint8_t*)(0x40061008UL))
#define FM0P_DSTC_CMD                             *((volatile  uint8_t*)(0x40061008UL))
#define FM_DSTC_CFG                               *((volatile  uint8_t*)(0x40061009UL))
#define FM0P_DSTC_CFG                             *((volatile  uint8_t*)(0x40061009UL))
#define FM_DSTC_SWTR                              *((volatile uint16_t*)(0x4006100AUL))
#define FM0P_DSTC_SWTR                            *((volatile uint16_t*)(0x4006100AUL))
#define FM_DSTC_MONERS                            *((volatile uint32_t*)(0x4006100CUL))
#define FM0P_DSTC_MONERS                          *((volatile uint32_t*)(0x4006100CUL))
#define FM_DSTC_DREQENB0                          *((volatile uint32_t*)(0x40061010UL))
#define FM0P_DSTC_DREQENB0                        *((volatile uint32_t*)(0x40061010UL))
#define FM_DSTC_DREQENB1                          *((volatile uint32_t*)(0x40061014UL))
#define FM0P_DSTC_DREQENB1                        *((volatile uint32_t*)(0x40061014UL))
#define FM_DSTC_HWINT0                            *((volatile uint32_t*)(0x40061030UL))
#define FM0P_DSTC_HWINT0                          *((volatile uint32_t*)(0x40061030UL))
#define FM_DSTC_HWINT1                            *((volatile uint32_t*)(0x40061034UL))
#define FM0P_DSTC_HWINT1                          *((volatile uint32_t*)(0x40061034UL))
#define FM_DSTC_HWINTCLR0                         *((volatile uint32_t*)(0x40061050UL))
#define FM0P_DSTC_HWINTCLR0                       *((volatile uint32_t*)(0x40061050UL))
#define FM_DSTC_HWINTCLR1                         *((volatile uint32_t*)(0x40061054UL))
#define FM0P_DSTC_HWINTCLR1                       *((volatile uint32_t*)(0x40061054UL))
#define FM_DSTC_DQMSK0                            *((volatile uint32_t*)(0x40061070UL))
#define FM0P_DSTC_DQMSK0                          *((volatile uint32_t*)(0x40061070UL))
#define FM_DSTC_DQMSK1                            *((volatile uint32_t*)(0x40061074UL))
#define FM0P_DSTC_DQMSK1                          *((volatile uint32_t*)(0x40061074UL))
#define FM_DSTC_DQMSKCLR0                         *((volatile uint32_t*)(0x40061090UL))
#define FM0P_DSTC_DQMSKCLR0                       *((volatile uint32_t*)(0x40061090UL))
#define FM_DSTC_DQMSKCLR1                         *((volatile uint32_t*)(0x40061094UL))
#define FM0P_DSTC_DQMSKCLR1                       *((volatile uint32_t*)(0x40061094UL))

/*******************************************************************************
* DT Registers DT
*   Register Definition
*******************************************************************************/
#define FM_DT_TIMER1LOAD                          *((volatile uint32_t*)(0x40015000UL))
#define FM0P_DT_TIMER1LOAD                        *((volatile uint32_t*)(0x40015000UL))
#define FM_DT_TIMER1VALUE                         *((volatile uint32_t*)(0x40015004UL))
#define FM0P_DT_TIMER1VALUE                       *((volatile uint32_t*)(0x40015004UL))
#define FM_DT_TIMER1CONTROL                       *((volatile uint32_t*)(0x40015008UL))
#define FM0P_DT_TIMER1CONTROL                     *((volatile uint32_t*)(0x40015008UL))
#define FM_DT_TIMER1INTCLR                        *((volatile uint32_t*)(0x4001500CUL))
#define FM0P_DT_TIMER1INTCLR                      *((volatile uint32_t*)(0x4001500CUL))
#define FM_DT_TIMER1RIS                           *((volatile uint32_t*)(0x40015010UL))
#define FM0P_DT_TIMER1RIS                         *((volatile uint32_t*)(0x40015010UL))
#define FM_DT_TIMER1MIS                           *((volatile uint32_t*)(0x40015014UL))
#define FM0P_DT_TIMER1MIS                         *((volatile uint32_t*)(0x40015014UL))
#define FM_DT_TIMER1BGLOAD                        *((volatile uint32_t*)(0x40015018UL))
#define FM0P_DT_TIMER1BGLOAD                      *((volatile uint32_t*)(0x40015018UL))
#define FM_DT_TIMER2LOAD                          *((volatile uint32_t*)(0x40015020UL))
#define FM0P_DT_TIMER2LOAD                        *((volatile uint32_t*)(0x40015020UL))
#define FM_DT_TIMER2VALUE                         *((volatile uint32_t*)(0x40015024UL))
#define FM0P_DT_TIMER2VALUE                       *((volatile uint32_t*)(0x40015024UL))
#define FM_DT_TIMER2CONTROL                       *((volatile uint32_t*)(0x40015028UL))
#define FM0P_DT_TIMER2CONTROL                     *((volatile uint32_t*)(0x40015028UL))
#define FM_DT_TIMER2INTCLR                        *((volatile uint32_t*)(0x4001502CUL))
#define FM0P_DT_TIMER2INTCLR                      *((volatile uint32_t*)(0x4001502CUL))
#define FM_DT_TIMER2RIS                           *((volatile uint32_t*)(0x40015030UL))
#define FM0P_DT_TIMER2RIS                         *((volatile uint32_t*)(0x40015030UL))
#define FM_DT_TIMER2MIS                           *((volatile uint32_t*)(0x40015034UL))
#define FM0P_DT_TIMER2MIS                         *((volatile uint32_t*)(0x40015034UL))
#define FM_DT_TIMER2BGLOAD                        *((volatile uint32_t*)(0x40015038UL))
#define FM0P_DT_TIMER2BGLOAD                      *((volatile uint32_t*)(0x40015038UL))

/*******************************************************************************
* EXTI Registers EXTI
*   Register Definition
*******************************************************************************/
#define FM_EXTI_ENIR                              *((volatile uint32_t*)(0x40030000UL))
#define FM0P_EXTI_ENIR                            *((volatile uint32_t*)(0x40030000UL))
#define FM_EXTI_EIRR                              *((volatile uint32_t*)(0x40030004UL))
#define FM0P_EXTI_EIRR                            *((volatile uint32_t*)(0x40030004UL))
#define FM_EXTI_EICL                              *((volatile uint32_t*)(0x40030008UL))
#define FM0P_EXTI_EICL                            *((volatile uint32_t*)(0x40030008UL))
#define FM_EXTI_ELVR                              *((volatile uint32_t*)(0x4003000CUL))
#define FM0P_EXTI_ELVR                            *((volatile uint32_t*)(0x4003000CUL))
#define FM_EXTI_ELVR1                             *((volatile uint32_t*)(0x40030010UL))
#define FM0P_EXTI_ELVR1                           *((volatile uint32_t*)(0x40030010UL))
#define FM_EXTI_NMIRR                             *((volatile uint16_t*)(0x40030014UL))
#define FM0P_EXTI_NMIRR                           *((volatile uint16_t*)(0x40030014UL))
#define FM_EXTI_NMICL                             *((volatile uint16_t*)(0x40030018UL))
#define FM0P_EXTI_NMICL                           *((volatile uint16_t*)(0x40030018UL))
#define FM_EXTI_ELVR2                             *((volatile uint32_t*)(0x4003001CUL))
#define FM0P_EXTI_ELVR2                           *((volatile uint32_t*)(0x4003001CUL))
#define FM_EXTI_NMIENR                            *((volatile  uint8_t*)(0x40030020UL))
#define FM0P_EXTI_NMIENR                          *((volatile  uint8_t*)(0x40030020UL))

