MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12B0AGP20000/mcu.h
#define FM0P_MFS_CSIO_RDR_AVAILABLE               1
#define FM_MFS_CSIO_RDR_AVAILABLE                 1
#define FM0P_MFS_CSIO_SACSR_AVAILABLE             1
#define FM_MFS_CSIO_SACSR_AVAILABLE               1
#define FM0P_MFS_CSIO_SCR_AVAILABLE               1
#define FM_MFS_CSIO_SCR_AVAILABLE                 1
#define FM0P_MFS_CSIO_SCSCR_AVAILABLE             1
#define FM_MFS_CSIO_SCSCR_AVAILABLE               1
#define FM0P_MFS_CSIO_SCSFR0_AVAILABLE            1
#define FM_MFS_CSIO_SCSFR0_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSFR1_AVAILABLE            1
#define FM_MFS_CSIO_SCSFR1_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSFR2_AVAILABLE            1
#define FM_MFS_CSIO_SCSFR2_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSTR0_AVAILABLE            1
#define FM_MFS_CSIO_SCSTR0_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSTR1_AVAILABLE            1
#define FM_MFS_CSIO_SCSTR1_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSTR32_AVAILABLE           1
#define FM_MFS_CSIO_SCSTR32_AVAILABLE             1
#define FM0P_MFS_CSIO_SMR_AVAILABLE               1
#define FM_MFS_CSIO_SMR_AVAILABLE                 1
#define FM0P_MFS_CSIO_SSR_AVAILABLE               1
#define FM_MFS_CSIO_SSR_AVAILABLE                 1
#define FM0P_MFS_CSIO_STMCR_AVAILABLE             1
#define FM_MFS_CSIO_STMCR_AVAILABLE               1
#define FM0P_MFS_CSIO_STMR_AVAILABLE              1
#define FM_MFS_CSIO_STMR_AVAILABLE                1
#define FM0P_MFS_CSIO_TBYTE0_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE0_AVAILABLE              1
#define FM0P_MFS_CSIO_TBYTE1_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE1_AVAILABLE              1
#define FM0P_MFS_CSIO_TBYTE2_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE2_AVAILABLE              1
#define FM0P_MFS_CSIO_TBYTE3_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE3_AVAILABLE              1
#define FM0P_MFS_CSIO_TDR_AVAILABLE               1
#define FM_MFS_CSIO_TDR_AVAILABLE                 1
#define FM0P_MFS_I2C_BGR_AVAILABLE                1
#define FM_MFS_I2C_BGR_AVAILABLE                  1
#define FM0P_MFS_I2C_EIBCR_AVAILABLE              1
#define FM_MFS_I2C_EIBCR_AVAILABLE                1
#define FM0P_MFS_I2C_FBYTE1_AVAILABLE             1
#define FM_MFS_I2C_FBYTE1_AVAILABLE               1
#define FM0P_MFS_I2C_FBYTE2_AVAILABLE             1
#define FM_MFS_I2C_FBYTE2_AVAILABLE               1
#define FM0P_MFS_I2C_FCR_AVAILABLE                1
#define FM_MFS_I2C_FCR_AVAILABLE                  1
#define FM0P_MFS_I2C_IBCR_AVAILABLE               1
#define FM_MFS_I2C_IBCR_AVAILABLE                 1
#define FM0P_MFS_I2C_IBSR_AVAILABLE               1
#define FM_MFS_I2C_IBSR_AVAILABLE                 1
#define FM0P_MFS_I2C_ISBA_AVAILABLE               1
#define FM_MFS_I2C_ISBA_AVAILABLE                 1
#define FM0P_MFS_I2C_ISMK_AVAILABLE               1
#define FM_MFS_I2C_ISMK_AVAILABLE                 1
#define FM0P_MFS_I2C_RDR_AVAILABLE                1
#define FM_MFS_I2C_RDR_AVAILABLE                  1
#define FM0P_MFS_I2C_SMR_AVAILABLE                1
#define FM_MFS_I2C_SMR_AVAILABLE                  1
#define FM0P_MFS_I2C_SSR_AVAILABLE                1
#define FM_MFS_I2C_SSR_AVAILABLE                  1
#define FM0P_MFS_I2C_TDR_AVAILABLE                1
#define FM_MFS_I2C_TDR_AVAILABLE                  1
#define FM0P_MFS_I2S_ESCR_AVAILABLE               1
#define FM_MFS_I2S_ESCR_AVAILABLE                 1
#define FM0P_MFS_I2S_FBYTE1_AVAILABLE             1
#define FM_MFS_I2S_FBYTE1_AVAILABLE               1
#define FM0P_MFS_I2S_FBYTE2_AVAILABLE             1
#define FM_MFS_I2S_FBYTE2_AVAILABLE               1
#define FM0P_MFS_I2S_FCR_AVAILABLE                1
#define FM_MFS_I2S_FCR_AVAILABLE                  1
#define FM0P_MFS_I2S_RDR_AVAILABLE                1
#define FM_MFS_I2S_RDR_AVAILABLE                  1
#define FM0P_MFS_I2S_SCR_AVAILABLE                1
#define FM_MFS_I2S_SCR_AVAILABLE                  1
#define FM0P_MFS_I2S_SMR_AVAILABLE                1
#define FM_MFS_I2S_SMR_AVAILABLE                  1
#define FM0P_MFS_I2S_SSR_AVAILABLE                1
#define FM_MFS_I2S_SSR_AVAILABLE                  1
#define FM0P_MFS_I2S_TDR_AVAILABLE                1
#define FM_MFS_I2S_TDR_AVAILABLE                  1
#define FM0P_MFS_LIN_BGR_AVAILABLE                1
#define FM_MFS_LIN_BGR_AVAILABLE                  1
#define FM0P_MFS_LIN_ESCR_AVAILABLE               1
#define FM_MFS_LIN_ESCR_AVAILABLE                 1
#define FM0P_MFS_LIN_FBYTE1_AVAILABLE             1
#define FM_MFS_LIN_FBYTE1_AVAILABLE               1
#define FM0P_MFS_LIN_FBYTE2_AVAILABLE             1
#define FM_MFS_LIN_FBYTE2_AVAILABLE               1
#define FM0P_MFS_LIN_FCR_AVAILABLE                1
#define FM_MFS_LIN_FCR_AVAILABLE                  1
#define FM0P_MFS_LIN_RDR_AVAILABLE                1
#define FM_MFS_LIN_RDR_AVAILABLE                  1
#define FM0P_MFS_LIN_SCR_AVAILABLE                1
#define FM_MFS_LIN_SCR_AVAILABLE                  1
#define FM0P_MFS_LIN_SMR_AVAILABLE                1
#define FM_MFS_LIN_SMR_AVAILABLE                  1
#define FM0P_MFS_LIN_SSR_AVAILABLE                1
#define FM_MFS_LIN_SSR_AVAILABLE                  1
#define FM0P_MFS_LIN_TDR_AVAILABLE                1
#define FM_MFS_LIN_TDR_AVAILABLE                  1
#define FM0P_MFS_UART_BGR_AVAILABLE               1
#define FM_MFS_UART_BGR_AVAILABLE                 1
#define FM0P_MFS_UART_ESCR_AVAILABLE              1
#define FM_MFS_UART_ESCR_AVAILABLE                1
#define FM0P_MFS_UART_FBYTE1_AVAILABLE            1
#define FM_MFS_UART_FBYTE1_AVAILABLE              1
#define FM0P_MFS_UART_FBYTE2_AVAILABLE            1
#define FM_MFS_UART_FBYTE2_AVAILABLE              1
#define FM0P_MFS_UART_FCR_AVAILABLE               1
#define FM_MFS_UART_FCR_AVAILABLE                 1
#define FM0P_MFS_UART_RDR_AVAILABLE               1
#define FM_MFS_UART_RDR_AVAILABLE                 1
#define FM0P_MFS_UART_SCR_AVAILABLE               1
#define FM_MFS_UART_SCR_AVAILABLE                 1
#define FM0P_MFS_UART_SMR_AVAILABLE               1
#define FM_MFS_UART_SMR_AVAILABLE                 1
#define FM0P_MFS_UART_SSR_AVAILABLE               1
#define FM_MFS_UART_SSR_AVAILABLE                 1
#define FM0P_MFS_UART_TDR_AVAILABLE               1
#define FM_MFS_UART_TDR_AVAILABLE                 1
/*******************************************************************************
* MFSI2S0
*******************************************************************************/
#define FM0P_MFSI2S_CNTLREG_AVAILABLE             1
#define FM_MFSI2S_CNTLREG_AVAILABLE               1
#define FM0P_MFSI2S_I2SCLK_AVAILABLE              1
#define FM_MFSI2S_I2SCLK_AVAILABLE                1
#define FM0P_MFSI2S_I2SRST_AVAILABLE              1
#define FM_MFSI2S_I2SRST_AVAILABLE                1
#define FM0P_MFSI2S_I2SST_AVAILABLE               1
#define FM_MFSI2S_I2SST_AVAILABLE                 1
/*******************************************************************************
* MTB_DWT
*******************************************************************************/
#define FM0P_MTB_DWT_CID0_AVAILABLE               1
#define FM_MTB_DWT_CID0_AVAILABLE                 1
#define FM0P_MTB_DWT_CID1_AVAILABLE               1
#define FM_MTB_DWT_CID1_AVAILABLE                 1
#define FM0P_MTB_DWT_CID2_AVAILABLE               1
#define FM_MTB_DWT_CID2_AVAILABLE                 1
#define FM0P_MTB_DWT_CID3_AVAILABLE               1
#define FM_MTB_DWT_CID3_AVAILABLE                 1
#define FM0P_MTB_DWT_CMP_ADDR_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_ADDR_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_ADDR_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_ADDR_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_CMP_DATA_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_DATA_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_DATA_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_DATA_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_CMP_MASK_START_AVAILABLE     1
#define FM_MTB_DWT_CMP_MASK_START_AVAILABLE       1
#define FM0P_MTB_DWT_CMP_MASK_STOP_AVAILABLE      1
#define FM_MTB_DWT_CMP_MASK_STOP_AVAILABLE        1
#define FM0P_MTB_DWT_FCT_AVAILABLE                1
#define FM_MTB_DWT_FCT_AVAILABLE                  1
#define FM0P_MTB_DWT_PID0_AVAILABLE               1
#define FM_MTB_DWT_PID0_AVAILABLE                 1
#define FM0P_MTB_DWT_PID1_AVAILABLE               1
#define FM_MTB_DWT_PID1_AVAILABLE                 1
#define FM0P_MTB_DWT_PID2_AVAILABLE               1
#define FM_MTB_DWT_PID2_AVAILABLE                 1
#define FM0P_MTB_DWT_PID3_AVAILABLE               1
#define FM_MTB_DWT_PID3_AVAILABLE                 1
#define FM0P_MTB_DWT_PID4_AVAILABLE               1
#define FM_MTB_DWT_PID4_AVAILABLE                 1
#define FM0P_MTB_DWT_PID5_AVAILABLE               1
#define FM_MTB_DWT_PID5_AVAILABLE                 1
#define FM0P_MTB_DWT_PID6_AVAILABLE               1
#define FM_MTB_DWT_PID6_AVAILABLE                 1
#define FM0P_MTB_DWT_PID7_AVAILABLE               1
#define FM_MTB_DWT_PID7_AVAILABLE                 1
/*******************************************************************************
* RTC
*******************************************************************************/
#define FM0P_RTC_ALDR_AVAILABLE                   1
#define FM_RTC_ALDR_AVAILABLE                     1
#define FM0P_RTC_ALHR_AVAILABLE                   1
#define FM_RTC_ALHR_AVAILABLE                     1
#define FM0P_RTC_ALMIR_AVAILABLE                  1
#define FM_RTC_ALMIR_AVAILABLE                    1
#define FM0P_RTC_ALMOR_AVAILABLE                  1
#define FM_RTC_ALMOR_AVAILABLE                    1
#define FM0P_RTC_ALYR_AVAILABLE                   1
#define FM_RTC_ALYR_AVAILABLE                     1
#define FM0P_RTC_WTBR_AVAILABLE                   1
#define FM_RTC_WTBR_AVAILABLE                     1
#define FM0P_RTC_WTCAL_AVAILABLE                  1
#define FM_RTC_WTCAL_AVAILABLE                    1
#define FM0P_RTC_WTCALEN_AVAILABLE                1
#define FM_RTC_WTCALEN_AVAILABLE                  1
#define FM0P_RTC_WTCALPRD_AVAILABLE               1
#define FM_RTC_WTCALPRD_AVAILABLE                 1
#define FM0P_RTC_WTCLKM_AVAILABLE                 1
#define FM_RTC_WTCLKM_AVAILABLE                   1
#define FM0P_RTC_WTCLKS_AVAILABLE                 1
#define FM_RTC_WTCLKS_AVAILABLE                   1
#define FM0P_RTC_WTCOSEL_AVAILABLE                1
#define FM_RTC_WTCOSEL_AVAILABLE                  1
#define FM0P_RTC_WTCR1_AVAILABLE                  1
#define FM_RTC_WTCR1_AVAILABLE                    1
#define FM0P_RTC_WTCR2_AVAILABLE                  1
#define FM_RTC_WTCR2_AVAILABLE                    1
#define FM0P_RTC_WTDIV_AVAILABLE                  1
#define FM_RTC_WTDIV_AVAILABLE                    1
#define FM0P_RTC_WTDIVEN_AVAILABLE                1
#define FM_RTC_WTDIVEN_AVAILABLE                  1
#define FM0P_RTC_WTDR_AVAILABLE                   1
#define FM_RTC_WTDR_AVAILABLE                     1
#define FM0P_RTC_WTDW_AVAILABLE                   1
#define FM_RTC_WTDW_AVAILABLE                     1
#define FM0P_RTC_WTHR_AVAILABLE                   1
#define FM_RTC_WTHR_AVAILABLE                     1
#define FM0P_RTC_WTMIR_AVAILABLE                  1
#define FM_RTC_WTMIR_AVAILABLE                    1
#define FM0P_RTC_WTMOR_AVAILABLE                  1
#define FM_RTC_WTMOR_AVAILABLE                    1
#define FM0P_RTC_WTSR_AVAILABLE                   1
#define FM_RTC_WTSR_AVAILABLE                     1
#define FM0P_RTC_WTTR_AVAILABLE                   1
#define FM_RTC_WTTR_AVAILABLE                     1
#define FM0P_RTC_WTYR_AVAILABLE                   1
#define FM_RTC_WTYR_AVAILABLE                     1
/*******************************************************************************
* SBSSR
*******************************************************************************/
#define FM0P_SBSSR_BTSSSR_AVAILABLE               1
#define FM_SBSSR_BTSSSR_AVAILABLE                 1
/*******************************************************************************
* SMCIF1
*******************************************************************************/
#define FM0P_SMCIF_BAUDRATE_AVAILABLE             1
#define FM_SMCIF_BAUDRATE_AVAILABLE               1
#define FM0P_SMCIF_CARDCLOCK_AVAILABLE            1
#define FM_SMCIF_CARDCLOCK_AVAILABLE              1
#define FM0P_SMCIF_DATA_AVAILABLE                 1
#define FM_SMCIF_DATA_AVAILABLE                   1
#define FM0P_SMCIF_DATA_FIFO_AVAILABLE            1
#define FM_SMCIF_DATA_FIFO_AVAILABLE              1
#define FM0P_SMCIF_FIFO_CLEAR_MSB_READ_AVAILABLE  1
#define FM_SMCIF_FIFO_CLEAR_MSB_READ_AVAILABLE    1
#define FM0P_SMCIF_FIFO_CLEAR_MSB_WRITE_AVAILABLE 1
#define FM_SMCIF_FIFO_CLEAR_MSB_WRITE_AVAILABLE   1
#define FM0P_SMCIF_FIFO_LEVEL_READ_AVAILABLE      1
#define FM_SMCIF_FIFO_LEVEL_READ_AVAILABLE        1
#define FM0P_SMCIF_FIFO_LEVEL_WRITE_AVAILABLE     1
#define FM_SMCIF_FIFO_LEVEL_WRITE_AVAILABLE       1
#define FM0P_SMCIF_FIFO_MODE_AVAILABLE            1
#define FM_SMCIF_FIFO_MODE_AVAILABLE              1
#define FM0P_SMCIF_GLOBALCONTROL1_AVAILABLE       1
#define FM_SMCIF_GLOBALCONTROL1_AVAILABLE         1
#define FM0P_SMCIF_GLOBALCONTROL2_AVAILABLE       1
#define FM_SMCIF_GLOBALCONTROL2_AVAILABLE         1
#define FM0P_SMCIF_GUARDTIMER_AVAILABLE           1
#define FM_SMCIF_GUARDTIMER_AVAILABLE             1
#define FM0P_SMCIF_IDLETIMER_AVAILABLE            1
#define FM_SMCIF_IDLETIMER_AVAILABLE              1
#define FM0P_SMCIF_IRQ_STATUS_AVAILABLE           1
#define FM_SMCIF_IRQ_STATUS_AVAILABLE             1
#define FM0P_SMCIF_PORTCONTROL_AVAILABLE          1
#define FM_SMCIF_PORTCONTROL_AVAILABLE            1
#define FM0P_SMCIF_STATUS_AVAILABLE               1
#define FM_SMCIF_STATUS_AVAILABLE                 1
/*******************************************************************************
* SWWDT
*******************************************************************************/
#define FM0P_SWWDT_WDOGCONTROL_AVAILABLE          1
#define FM_SWWDT_WDOGCONTROL_AVAILABLE            1
#define FM0P_SWWDT_WDOGINTCLR_AVAILABLE           1
#define FM_SWWDT_WDOGINTCLR_AVAILABLE             1
#define FM0P_SWWDT_WDOGLOAD_AVAILABLE             1
#define FM_SWWDT_WDOGLOAD_AVAILABLE               1
#define FM0P_SWWDT_WDOGLOCK_AVAILABLE             1
#define FM_SWWDT_WDOGLOCK_AVAILABLE               1
#define FM0P_SWWDT_WDOGRIS_AVAILABLE              1
#define FM_SWWDT_WDOGRIS_AVAILABLE                1
#define FM0P_SWWDT_WDOGSPMC_AVAILABLE             1
#define FM_SWWDT_WDOGSPMC_AVAILABLE               1
#define FM0P_SWWDT_WDOGVALUE_AVAILABLE            1
#define FM_SWWDT_WDOGVALUE_AVAILABLE              1
/*******************************************************************************
* UNIQUE_ID
*******************************************************************************/
#define FM0P_UNIQUE_ID_UIDR0_AVAILABLE            1
#define FM_UNIQUE_ID_UIDR0_AVAILABLE              1
#define FM0P_UNIQUE_ID_UIDR1_AVAILABLE            1
#define FM_UNIQUE_ID_UIDR1_AVAILABLE              1
/*******************************************************************************
* VIR
*******************************************************************************/
#define FM0P_VIR_VIR00_AVAILABLE                  1
#define FM_VIR_VIR00_AVAILABLE                    1
#define FM0P_VIR_VIR01_AVAILABLE                  1
#define FM_VIR_VIR01_AVAILABLE                    1
#define FM0P_VIR_VIR02_AVAILABLE                  1
#define FM_VIR_VIR02_AVAILABLE                    1
#define FM0P_VIR_VIR03_AVAILABLE                  1
#define FM_VIR_VIR03_AVAILABLE                    1
#define FM0P_VIR_VIR04_AVAILABLE                  1
#define FM_VIR_VIR04_AVAILABLE                    1
#define FM0P_VIR_VIR05_AVAILABLE                  1
#define FM_VIR_VIR05_AVAILABLE                    1
#define FM0P_VIR_VIR06_AVAILABLE                  1
#define FM_VIR_VIR06_AVAILABLE                    1
#define FM0P_VIR_VIR07_AVAILABLE                  1
#define FM_VIR_VIR07_AVAILABLE                    1
#define FM0P_VIR_VIR08_AVAILABLE                  1
#define FM_VIR_VIR08_AVAILABLE                    1
#define FM0P_VIR_VIR09_AVAILABLE                  1
#define FM_VIR_VIR09_AVAILABLE                    1
#define FM0P_VIR_VIR10_AVAILABLE                  1
#define FM_VIR_VIR10_AVAILABLE                    1
#define FM0P_VIR_VIR11_AVAILABLE                  1
#define FM_VIR_VIR11_AVAILABLE                    1
#define FM0P_VIR_VIR12_AVAILABLE                  1
#define FM_VIR_VIR12_AVAILABLE                    1
#define FM0P_VIR_VIR13_AVAILABLE                  1
#define FM_VIR_VIR13_AVAILABLE                    1
#define FM0P_VIR_VIR14_AVAILABLE                  1
#define FM_VIR_VIR14_AVAILABLE                    1
#define FM0P_VIR_VIR15_AVAILABLE                  1
#define FM_VIR_VIR15_AVAILABLE                    1
#define FM0P_VIR_VIR16_AVAILABLE                  1
#define FM_VIR_VIR16_AVAILABLE                    1
#define FM0P_VIR_VIR17_AVAILABLE                  1
#define FM_VIR_VIR17_AVAILABLE                    1
#define FM0P_VIR_VIR18_AVAILABLE                  1
#define FM_VIR_VIR18_AVAILABLE                    1
#define FM0P_VIR_VIR19_AVAILABLE                  1
#define FM_VIR_VIR19_AVAILABLE                    1
#define FM0P_VIR_VIR20_AVAILABLE                  1
#define FM_VIR_VIR20_AVAILABLE                    1
#define FM0P_VIR_VIR21_AVAILABLE                  1
#define FM_VIR_VIR21_AVAILABLE                    1
#define FM0P_VIR_VIR22_AVAILABLE                  1
#define FM_VIR_VIR22_AVAILABLE                    1
#define FM0P_VIR_VIR23_AVAILABLE                  1
#define FM_VIR_VIR23_AVAILABLE                    1
#define FM0P_VIR_VIR24_AVAILABLE                  1
#define FM_VIR_VIR24_AVAILABLE                    1
#define FM0P_VIR_VIR25_AVAILABLE                  1
#define FM_VIR_VIR25_AVAILABLE                    1
#define FM0P_VIR_VIR26_AVAILABLE                  1
#define FM_VIR_VIR26_AVAILABLE                    1
#define FM0P_VIR_VIR27_AVAILABLE                  1
#define FM_VIR_VIR27_AVAILABLE                    1
#define FM0P_VIR_VIR28_AVAILABLE                  1
#define FM_VIR_VIR28_AVAILABLE                    1
#define FM0P_VIR_VIR29_AVAILABLE                  1
#define FM_VIR_VIR29_AVAILABLE                    1
#define FM0P_VIR_VIR30_AVAILABLE                  1
#define FM_VIR_VIR30_AVAILABLE                    1
#define FM0P_VIR_VIR31_AVAILABLE                  1
#define FM_VIR_VIR31_AVAILABLE                    1
/*******************************************************************************
* WC
*******************************************************************************/
#define FM0P_WC_CLK_EN_AVAILABLE                  1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM0P_WC_CLK_SEL_AVAILABLE                 1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM0P_WC_WCCR_AVAILABLE                    1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM0P_WC_WCRD_AVAILABLE                    1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM0P_WC_WCRL_AVAILABLE                    1
#define FM_WC_WCRL_AVAILABLE                      1

